# a = 8 * (8)
# b = 8 * (8,)
# print (a)
# print (b)

# 创建多个值
# t = (1, 2, 3, 4, 5, 6)
# print (type (t))
# print (t)
# t = 1, 2, 3, 4, 5, 6
# print (type (t))
# print (t)


# 用其他数据类型转换元祖形式

# lists = [1, 2, 3, 4]

"""
1,元祖是有序的
2，元祖是不可更改的
3，元祖的创建有3中
"""

# 索引操作

# t = (1, 2, 3, 4, 56, 7, 8)
# print (t[3])

# 超标的错误
# 异常处理


# 切片
# t = (1, 2, 3, 4, 5, 6, 7, 8)
# t1 = t[1::2]
# print (t1)
# print (id (t))
# print (id (t1))
# # 切片是可以超标的
# t2 = t[1::100]
# print (t2)

# 元祖是不能修改的，修改会报错

# 元祖进行更新和修改
# 更新的元祖
# 使用切片的形式
# t = (1, 2, 3, 4, 5, 6, 7, 8)
# t = t[0:2] + (10,) + t[2:]
# print(t)
# 注意：逗号和小括号是必须的

# 使用切片对元祖的元素尽心删除
# t = t[0:1] + t[2:]
# print(t)

# t = (1, 2, 3, 4, 5, 6, 7, 8)  # 0，1，2，3，4，5，6，7
#
# # 切片 左闭右开
# print (t[0:2])
# print (t[0::2])  # 2是步长
# print (t[0::3])

# 元祖相加

# 元祖相乘
